{
    "Home": "",
    "Services": "",
    "Galleries": "",
    "Procedures": "",
    "Contact": "",
    "Luxury Horizon 3M": "",
    "Book An Appointment!": "",
    "The basis for any successful business is a creative and distinct idea, hence the launch of Luxury Horizon to be the place you trust to take care of your car. In 3M more than one service in one place, this in itself is another sign of excellence.": "",
    "Ahlan Wasahlan to LUXURY HORIZON": "",
    "It has been almost 5 years since we started a car maintenance service company in Riyadh, the Heart of the Kingdom of Saudi Arabia. LUXURY HORIZON (LH) is a bona fide company and and authorized dealer of 3M. It is among the biggest workshop for maintaining mostly luxury cars, and basic cars as well, all over Riyadh.": "",
    "LH has 5 large workshops accross Riyadh, and by having highly skilled technical workers and complete set of tools, we can assure your satisfaction with our quality services.": "",
    "Large workshops.": "",
    "Highly skilled technical workers.": "",
    "Quality services.": "",
    "Maintaining mostly luxury cars.": "",
    "Mission and Vision": "",
    "We believe in not accepting the status quo, in constant improvement, and in the value of ongoing education in any form. We believe in providing opportunity for personal professional and organizational growth within our company.": "",
    "We believe that all decisions are to be made with integrity. Leadership is setting good examples for others to follow, expecting as much from yourself as from others.": "",
    "Our goal is to be an industry leader in providing unmatched quality automotive products and services": "",
    "We will constantly strive to meet the changing needs of our customers.": "",
    "Our aim is to provide an atmosphere that encourages employee teamwork, integrity and excellence.": "",
    "Together we will set and continually improve sales, service and operational standards to ensure long term market leadership and profitability.": "",
    "It is our mission to exceed our customers' and employees' expectations and maintain their loyalty for a lifetime.": "",
    "Galleries": "",
    "Previous": "",
    "Next": "",
    "Our Procedures": "",
    "Safe work practices are generally written methods outlining how to perform a task with minimum risk to people, equipment, materials, environment, and processes. Safe job procedures are a series of specific steps that guide a worker through a task from start to finish in a chronological order.": "",
    "Step 1": "",
    "Step 2": "",
    "Step 3": "",
    "Step 4": "",
    "Book Now": "",
    "Bring Vehicle": "",
    "Service Start": "",
    "Payment": "",
    "Feedback Section": "",
    "It is in our utmost interest to provide services for our Client's satisfaction.": "",
    "Address": "",
    "CALL US": ""
}
